[{"categories":["FMR"],"date":1658499720,"description":"FMR's Validation Schemes allow data managers to define balance equality validation rules. In this article we look at how Hierarchical Codelists can be used to automatically define such rules.","image":"https://metadatatechnology.github.io/sdmxioimages/posts/dataquality.png","objectID":"905bf492b7e1c6ee0203ffce865f300a","permalink":"https://metadatatechnology.github.io/sdmxio/blog/balance-equality-validation-rules-using-hcl/","summary":"Balance equalities are a useful addition to the data quality toolbox for checking arithmetic consistency between data points, often to ensure financial observations are in balance.\nIn FMR they are defined as structural metadata using a non SDMX standard artefact called Validation Schemes.\nWhen designing a Validation Scheme, one option is to define explicit arithmetic expressions on specific variables in a dataset. However hierarchical codelists can also be used for checking aggregate consistency within datasets.\nChecking aggregate consistency using custom expressions Aggregate balance equalities can be defined using custom expressions on each dimension of a Dataflow for the purpose of checking the consistency of reported aggregates with lower-level observations.","tags":["FMR","Validation","Hierarchies"],"title":"Creating balance equality validation rules using hierarical codelists in FMR"},{"categories":["FMR"],"date":1657030920,"description":"The FMR Docker image is self-contained and provides everything needed for a functional installation. However, some use cases require an external database for FMR's operational storage in preference to the MySQL service provided in the container. This article explains how.","image":"https://metadatatechnology.github.io/sdmxioimages/posts/docker-logo.png","objectID":"6b5ccd84809596193245684e4ec09cc7","permalink":"https://metadatatechnology.github.io/sdmxio/blog/how-to-use-an-external-database-with-fmr-docker/","summary":"The standard FMR Docker image is self contained in that includes everything needed to run a light-weight installation suitable for testing, personal use and light production workloads. But what happens if you want to use a database service external to the container? - SQL Server or Oracle for instance. This article explains how.\nAbout FMR\u0026rsquo;s operating database Just as a bit of background, FMR uses a SQL database for its operational storage - that is:\nstructural metadata content settings and configuration information audits and transaction history MySQL (5.7 and 8) is mature and free making it a good choice for many use cases.","tags":["FMR","Docker","installation","administration"],"title":"How to use an external database with the FMR Docker image"}]